# Level 019
# 1) კომენტარების სახით ახსენით რა არის ლისტები და რაში ვიყენებთ
# 2) ფორ ლუპის მეშვეობით რიცხვები გამოიტანეთ 1 დან 100 ჩათვლით
# 3) შექმენით 5 ელემენტისგან შემდგარი სია ხოლო შემდეგ დაბეჭდეთ მისი მე-3 და მე-5 მნიშვნელობა
# 4) ვინც საკლასო ვერ გააკეთეთ ეგ გავაკეთოთ სახლში (ვინც ვერ გაიგო შეატყობინეთ ლიდერს <3)
# 5) შექმენით 7 ელემენტიანი რიცხვებისგან შემდგარი სია, თქვენი დავალებაა გადაუაროთ მას ფორ ციკლით და დაბეჭდოთ ისეთი მნიშვნელობები რომლებიც აღემატება 20-ს

# ლისტებში შეგვიძლია შევინახოთ იმდენი ცვლადი რამდენიც გვინდა.

# ------------------

for i in range(100):
    print(i)

# -------------------------------------

x=["table","desk","apple","blue","egg"]
print(x[2])
print(x[4])

# -------------------------------------

y=[5,12,34,76,3,21,9]
for i in range(7):
    if y[i] > 20:
        print(y[i])


