# Level 02
# ---------------
# 1) 
name  = "ლუკა"
birthday = 2015

print("მოგესალმებით",name+"," "დაბადების დღე გაქვს", birthday)

# გამოასწორეთ და ახსენით რაში იყო შეცდომები 
# ----------------
# 1) შექმენით ცვლადი სახელად score, სადაც შეინახავთ მოთამაშის ქულას, საბოლოოდ print ით გამოიტანეთ
score=25
print(score)
# 2) შექმენი ცვლადი სახელად health, სადაც შეინახავთ მოთამაშის სიცოცხლეს, საბოლოოდ print ით გამოიტანეთ
health=(999)
print(health)
# 3) შექმენით 3 ცვლადი თქვენი ოჯახის წევრებზე და print ით გამოიტანეთ მათი სახელები და გვარები
დედა="ქეთევანი"
მამა="იოსები"
ბებია="დარეჯანი"
print(დედა,მამა,ბებია)
# 4) კონკატინაციის რაიმე მაგალითი მომიყვანეთ და ახსენით კომენტარებით
x=10
y="გიორგის"
print(y+" აქვს "+str(x)+" კვერცხი ")
# 5) დღევანდელი ნასწავლი დაახასიათე კომენტარებით
# კაია ძაან