# 1) კომენტარებით ახსენით მათემატიკური ოპერატორები
# 2) შექმენით ორი ცვლადი სადაც input ით კითხავთ მომხმარებელს რომ შეიყვანოს სხვადასხვა ციფრი და შეაჯამეთ ის
# 3) შექმენით ცვლადები და მათემატიკური ოპერატორების მეშვეობით გააკეთეთ მაგალითები
# 4) ამოცანა: ერთ ყუთში არის 4 ბურთი. თუ გვაქვს 3 ყუთი, რამდენი ბურთი გვაქვს სულ?
# 5) გამოიყენეთ შედარების ოპერატორები (< . > , >=, <=, ==, =!) სხვადასხვა მაგალითში, მაგ. შეადარეთ თქვენი და თქვენი ოჯახის წევრების ასაკი 

#  დვალება1

# + მიმატება
# - გამოკლება
# * გამრსვლება
# / გაყოფა
# % ნაშთი
# ** ხარრისხში აყვანა
# // დამრგალრბული გაყოფა

# დავალება2

x=int(input("შეიყვანე ციფრი:"))
y=int(input("კიდევ"))
print(x+y)


# დავლება3

z=15
c=3
print(z+c)
print(z*c)
print(z/c)
print(z%c)
print(z**c)
print(z//c)

# დავალება4

print(3*4)

# დავალება5

print(5>3)
print(5<3)
print(5>=3)
print(5<=3)
print(5==3)
print(5!=3)

