# 1: მათემატიკური კალკულატორი
# შექმენი პროგრამა, რომელიც:

# შეეკითეხბა მომხმარებელს ორ რიცხვს --- მინიშნება input()
# გამოთვლის ყველა ოპერაციას (+, -, *, /, //, **, %)
# დაბეჭდავს შედეგებს

# 2: ლუწი თუ კენტი რიცხვი if else ის გამოყენებით <3

# 3: ქულების სისტემა 📊
# შექმენი ქულების სისტემა:

# აქ სულ if ებით წერეთ :)))

# 90-100: "შესანიშნავი!"
# 80-89: "კარგი!"
# 70-79: "საშუალო"
# 60-69: "ცუდი"
# 0-59: "ძალიან ცუდი"

# 4: მაგარი დავალება 👌
# შექმენით კოდი რომლის გაშვების შემთხევვაში გავარკვეკთ
# აქვს თუ არა ასაკი ვინმეს ატაროოს "ზილი" ან "იკარუსი"

# 5: ამინდის პროგნოზი 🌦️🌅
# შექმენი პროგრამა, რომელიც რეკომენდაციას გაიღებს ჩაცმულობაზე:

# თუ ცხელა (>25°) და მზიანია → "მოკლე შარვალი და მაისური"
# თუ ცივა (<10°) ან წვიმს → "ქურთუკი და ქოლგა"
# სხვა შემთხვევაში → "ჩვეულებრივი ტანსაცმელი"

# დავალება1
number1=int(input("შეიყვანეთ რიცხვი: " ))
number2=int(input("შიყვანეთ კიდევ ერთი რიცხვი: "))
print(number1+number2)
print(number1-number2)
print(number1*number2)
print(number1/number2)
print(number1**number2)
print(number1//number2)
print(number1%number2)
# # დავალება2

# # ვერსია1
x=int(input("შეიყვანე რიხვი: "))
y=int(input("კიდევ ერთი: "))
gamyoi = x+y
if gamyoi % 2 == 0:
  print("ლუწია")
else:
    print("კენტია")
    

# # ვერსია2
v = 3
if v%2==0:
    print("ლუწია")
else:
    print("კენტია")



# # დავალება3
point=int(input("მიუთითე ქულა:"))
if point <= 90 >= 100 :
    print("შესანიშნავია!")


# დავალება4
age=int(input("რამდენი წლის ხარ?: "))
if age >= 18:
    print("შენ შეიგიძლია ატარო ზილი ან იკარუსი :)")
else:
    print("ბასტი ბუბუ იწყება;)")



# დავალება5
dagre=int(input("რამდენი გრადუსია?: "))
if dagre >= 25 :
    print("შეგიძლა ჩაიცვა შორტი და მაისური")
if dagre<=15:
    print("თბილად ჩაიცვი")

    # დავპრინტოთ ესეც
#   *
#   **    
#   ****
#   ******
#   ********
#   **********
 
print(" " * 6 + "*")
print(" " * 5 + "*" * 2)
print(" " * 4 + "*" * 3)
print(" " * 3 + "*" * 4)
print(" " * 2 + "*" * 5)
print(" " * 1 + "*" * 6)
print(" " * 0 + "*" * 7)
