# 1) შექმენი ფუნქცნია lion() სადაც  5 ელემენტიანი მასივი რომელიშ გამოიყენებთ .index() მეთოდს
# 2) შექმენი ფუნქცნია lion2() სადაც შექმენი 5 ელემენტიანი მასივი [1,1,1,1,1,1,1,2] რომელიშ გამოიყენებთ .index() მეთოდს და მიწვდებით ბოლო ელემენტს მხოლოდ index() !!!
# 3) შექმენი ფუნქცნია lion3() სადაც მისალმების ფუნქცია იქნება და თქვენ სახელს თუ ჩაწერთ გამოგიგდებთ თქვენს სახელს მაგალითად + "მე ვარ დავით ლომი" შედეგს <3 

# მხოლო სახელები შეცვალეთ "მე ვარ ანანო ლომი"
# 4) შექმენი ფუნქცნია lion4() სადაც შევქმნით ცარიელ მასივს და for loop ის გამოყენეით + .appnd() შევიტანთ მხოლოდ კენტ რიცხვებს

# 5) შექმენი ფუნქცნია lion5() სადაც მომხმარებელს შეეკითხებით სანამ პაროლს არ გამოიცნობს მანამდე დაუწეროს "პაროლი არასოწორია" მინიშნება while loop ი გამოიყენეთ

# დავალება 1
def lion(a,b,c,d,i):
    return a,b,c,d,i
print(lion(1,2,3,4,5))#---
# დავალება 2

# დავალება 3
def lion3(name):
    return "i am " + name
print(lion3("gio"))#+++

# დავალება 4
def only_odd_numbers(numbers):
    odd_list = []  # ცარიელი სია
    for num in numbers:
        if num % 2 != 0:  # ვამოწმებთ არის თუ არა კენტი
            odd_list.append(num)  # თუ კენტია, ვამატებთ სიაში
    return odd_list  # ვაბრუნებთ კენტ რიცხვებს

# გამოყენება:
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
result = only_odd_numbers(numbers)
print(result)


        
# დავალება 5
a = int(input("გამოიცანით 4 ნიშნა პაროლი: "))
b = 1234
while a != b:
    print(a)