txt = "     banana     "

x = txt.strip() # შლის სიცარიელეს გვერდებიდან.

print(x)


print("-----------------------")


txt2 = "  ,,,,,rrttgg.....banana....rrr  "

x2 = txt2.strip(" ,.grt") # ამ შემთხვევაში წაშლის სიცარიელესაცდა იმ ყველა ასოს და ელემენტსაც რომრლივ მითითებული გვაქვს

print(x2)


print("-----------------------")


txt3 = "  ,,,,,rrttgg..a...banana....rhrr" #strip არ მიყვბა როგორ for loop, ის მიყვება მარჯვნიდან და მარცხნიდან, თუ ის შეხვდრება ისეთ ელემენტს რომელიც არ გვაქვსმითითებული ის გაჩერდება და აღარ გააგძელებს კითხვას.

x3 = txt3.strip(" ,.grt") # ამ შემთხვევაში წაშლის სიცარიელესაცდა იმ ყველა ასოს და ელემენტსაც რომრლივ მითითებული გვაქვს

print(x3)  