# ✅ დავალება 1: ასაკის შემოწმება
# მიზანი: შეამოწმეთ მომხმარებლის ასაკი და დაადგინეთ, შეუძლია თუ არა მას მანქანის მართვა.

# ✅ დავალება 2: თერმომეტრის თბილ/ცივ მდგომარეობაში გადატანა
# მიზანი: შეამოწმეთ ჰაერის ტემპერატურა და დაადგინეთ, არის თუ არა ცივი თუ თბილი ამინდი.

# ✅ დავალება 3: საკუჭნაოში ნივთის რაოდენობა
# მიზანი: შეამოწმეთ თუ საკუჭნაოში არსებობს საკმარისი რაოდენობა კონკრეტული ნივთის (მაგ. პურის) და მიიღეთ გადაწყვეტილება, უნდა შეიძინოთ თუ არა.

# ✅ დავალება 4: გაყიდვა და ფასდაკლება
# მიზანი: შეამოწმეთ, თუ მომხმარებელს აქვს საკმარისი თანხა ნივთის შესაძენად და განახორციელეთ ფასდაკლება.

# ✅ დავალება 5: დაწერე გამოთვლა
# მიზანი: შეამოწმეთ, არის თუ არა რიცხვი კენტი თუ კი ერთმნიშვნელოვანი.

# დავალება1
age = int(input("რამდენი წის ხარ?: "))
if age >= 18:
    print("შენ შეგიძლია ატარო მანქანა") 
else:
    print("შენ არა შეგიძლია ატარო მანქანა")

print("---------------------------------")

# დავალება2
ტემპერატურა = int(input("რამდენია ტემპერატურა?: "))
if ტემპერატურა >= 30:
    print("ტემპეარატურა მაღალია.")
elif ტემპერატურა <= 10:
    print("ტემპერატურა დაბალია.")
elif ტემპერატურა < 15:
    print("ტემპერატურა ოდნავ დაბალია")
else:
    print("ტმპერატურა ნორმალურია.") 

print("---------------------------------")

# დავალება3
რაოდენობა = int(input("რამდეი ბოცაა საკუჭნაოში?: "))
if რაოდენობა >= 50:
    print("საკმარისია,ჯერ არ გვჭირდება.")
elif რაოდენობა >= 30:
    print("კარგი იქნება თუ დავამატებთ.")
elif რაოდენობა < 30:
    print("დაამატეთ.") 

print("---------------------------------")

# დავალება4
ფული = int(input("რამდენი გაქვს ფული?: "))
if ფული  >= 50:
    print("გაგიმართლათ ქალბატონო ლაზარე,ამ ნივთზე გვაქვს 50% ფასდაკლება:)")
elif ფული >= 30:
    print("ბოდიში,თქვენ აქციაში ვერ მოხვდით")
else:
    print("თუ ფული არ გქონდა სად მოდიოდი")

print("---------------------------------")

# დავალება5
x = int(input("შეიყვანე რიცხვი: "))
y = 2
if x % 2 == 0:
    print("რიცხვი ლუწია")
else:
    print("რიცხვი კენტია")