# 1) დღევანდელი მასალა ახსენით კომენტარებით (ლისტები, სლაისინგი , ა.შ)
# 2) შექმენით სია და შეიტანეთ ასოები, slicing-ის გამოყენებით გამოიტანეთ: პირველი 5 ასო, ბოლო 3 ასო, უკუღმა და მე-2 დან მე-6 ამდე
# 3) შექმენით სია და შეიტანეთ ციფრები და slicing-ის გამოყენებით გამოიტანეთ: თითოეული მეორე ელემენტი და ბოლო ოთხი ელემენტი უკუღმა.
# 4) text : "დილამშვიდობისა” და slicing-ის გამოყენებით ცალკე გამოიტანეთ "დილა" და ცალკე "მშვიდობისა"
# 5) sololearn 😎

# slice_array არის მონაცემთა ტიპი, რომელსაც შეუძლია შეინახოს ბევრი ცვლადი ლისტებში

slice_array=[1,2,3,4,5,6,7,8,9,10]
print(slice_array[:5])
print(slice_array[:-9:-1])
print(slice_array[1:6:])

print("-------------")

slice_text=["d","i","l","a","m","s","h","v","i","d","o","b","i","s","a"]
print(slice_text[:4],slice_text[4:])

#მნიშვნელობა ასევე შეგვიძლია მივანიჭოთ ასე
car=["bmw", "opel", "audi"]
a ,b ,c=car
print(a)
print(b)
print(c)
