# 1) შევქმნათ ლისტი სადაც შევინახავთ ტქვენი მშობლების სახელებს, და ბოლოში ჩაამატეთ თქვენი სახელიც
# 2) შექმენით რიცხვების სია. გადაუარეთ მას for ციკლითი. შეამოწმეთ თუ რიცხვი ლუწია დაბეჭდეთ "Number is even", სხვა შემთხვევაში "Number is Odd"
# 3) შექმენით სიტყვების სია 10 ელემენტისგან. გადაუარეთ for ციკლით ამ სიას ისე, რომ დაბეჭდოთ ყოველი მე-2 ელემენტი(დაგჭირდებათ slicing-ი)
# 4) შექმენით ცვლადი, სადაც შეინახავთ სიტყვას. გადაუარეთ მას for ციკლით, დაბეჭდეთ მისი თითოეული სიმბოლო და გვერდით მიუწერეთ მისი რიგის ნომერი string-ში(ანუ მერამდენე სიმბოლოა)

# მაგალითად: academy = "GOA"
# "G-1"
# "O-2"
# "A-3"

# გატესტეთ ეს დავალება სხვადასხვა სიტყვებზე და ნახეთ შედეგი

# 5) მოიძიეთ, როგორ შეიძლება სიის შემოტრიალება, შემდეგ შექმენით სია და დაბეჭდეთ ის შემოტრიალებულად. მაგალითად: [1,2] -> [2,1]

# 1
name=["qeti","soso"]
name.append("gio")
print(name)

print("-------------------")

# 2
num=[1,2,3,4,5,6,7,8,9,10]
x=2
for i in range(len(num)):
    if num[i] % x == 0:
        print("Number is even")
    else:
        print("number is odd")

print("-------------------")

# 3
z=[1,2,3,4,5,6,7,8,9,10]
for i in range(len(z)):
    print(z[i])

print("-------------------")

z=[1,2,3,4,5,6,7,8,9,10]
for i in range(len(z)):
    if z[i] % 2 == 0:
        print(z[i])
print("-------------------")
z=[1,2,3,4,5,6,7,8,9,10]
print(z[::2])

print("-------------------")

# 4
academy="goa"
for i in range(len(academy)):
    print(academy[i],"-",i)

print("-------------------")

# 5
numbers=[1,2,3,4,5]
print(numbers[::-1])
print("-------------------")
name="gio"
print(name[::-1])
print(name[0])
print(name[1])
print(name[2])
