# 1) გამოვიტანოთ print ით საყვარელი ფერი, საჭმელი, ჰობი
print("შავი,","კარტოფილი,","ძილი,")
# 2) შექმენით 5 ცვლადი თქვენ საყვარელ ფილმებზე
move1 = "ძროხა დიჯეი,"
move2 = "კაცი ტანსაცმლით,"
move3 = " 20 მუშკეტერი,"
move4 = " ჩექმებიანი ვირი,"
move5 = " კატა ძათლის კუდით,"
print(move1+move2+move3+move4+move5)
# 3) კომენტარების სახით ახსენით რას აკეთებს კონკატინაცია
# "სტრინგებს აერთებს ერტმანეთთან"
# 4) ჩამოთვალეთ დღეს ნასწავლი მონაცემტა ტიპები
# 5) ორი ცვლადი შექმენით: name(სახელი) და age(ასასკი). ცვლად name-ში ჩაწერე ნებისმიერი სახელი, ხოლო age-ში — რიცხვი. შემდეგ print ით გამოიტანე: "მე მქვია name და მე ვარ age წლის" 
name="ვალერი"
age=17
print(name + " aris " + str(age) + " wlis ") 