# 1) ინდენტაცია საჭიროა თუ არა და რატომ for loop ის დროს, მოიყვანეთ მაგალითები და ახსენით კომენტარით
# 2) for loop-ის მეშვეობით გამოიტანეთ რიცხვი 4, 7-ჯერ.
# 3) for loop-ის მეშვეობით გამოიტანეთ "I love cats" 8-ჯერ.
# 4) Input()-ის გამოყენებით მომხმარებელს შემოატანინეთ მისი სახელი, შემდეგ for loop-ით კი დაპრინტეთ ("hello" + მომხმარებლის სახელი) 5 ჯერ.
# 5) შევასწოროთ შეცდომები:

# for i in range5
# print("i")

# დავალება 1
# კი,საჭიროა,რადგან ვერ გამოიტანს მაგის გარეშე

# დავალება 2
for i in range(7):
    print(4)

# დავალება 3
for i in range(8):
    print( "i love cats" )

# დავალება 4
name=input( "რა გქვიათ?: " )
for i in range(5):
    print( "hello" + name ) 

for i in range(5):
    print("i")
