# 1) ახსენი  რას ნიშნავს “default value” ფუნქციის პარამეტრებში.

# default value არის ის მნიშვნელობა, რომელსაც ფუნქცია იყენებს მაშინ, როცა შენ არაფერს აძლევ.

# 2) ახსენით return ის მნიშვნელობა.

# return ასრულებს print-ის მნიშვნრლობას,ანუნგამოაქვს ტერმინალში

# 3) შექმენით ფუნქცია სახელწოდებით substract, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების სხვაობა.

def substract(a,b):
    c = a - b
    return c
print(substract(36,22))

# 4)  შექმენით ფუნქცია სახელწოდებით multiply, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების ნამრავლი.

def multiply(a,b):
    c = a * b
    return c
print(multiply(35,22))

# 5) შექმენით ფუნქცია სახელწოდებით divide, რომელსაც არგუმენტად ორ რიცხვს. ფუნქციამ პასუხად უნდა დააბრუნოს ამ რიცხვების განაყოფი.

def divide(a,b):
    c = a / b
    return c
print(divide(35,22))
