# 1) კომენტარებით ახსენით ბულიანი და შედარებითი ოპერატორები სადამდეც გავიარეთ
# 2) წარმოადგინეთ ყველა დათა ტიპის (str, int, float, boolean  (თუ შეძლებთ)) მაგალითები 5 - 5 ჯერ
# 3) input ით მომხარებელს შემოატანინეთ 2 მაგალითი და შეადარეთ
# 4) მოიყვანეთ მაგალითები True, False ის მაგალითად ჩართვა, გამორთვა
# 5 )SOLOLEARN 

# ბულიანი არის true და false , <> მეტია-ნაკლებია,+- პლიუს მინუსი,*/ გამრავლება გაყოფა.
name="gio"
citi="chiatura"
print(name,citi)

x=100
y=290
print(x+y)

f=input("daasaxele ricxvi: ")
k=input("kidev erti: ")
print(f>k)

v="შუქი_ჩართულია" 
b="შუქი_გამორთულია" 

kitxva=(input("მიუთითე შუქი_ჩართულია ან შუქი_გამორულია. შუქი ჩართულია?: "))
if ( kitxva == v ):
    print(True)
if ( kitxva == b ):
    print(False)
 