# 1) გამოვიტანოთ print ით საყვარელი ფერი, საჭმელი, ჰობი
# 2) შექმენით 5 ცვლადი თქვენ საყვარელ ფილმებზე
# 3) კომენტარების სახით ახსენით რას აკეთებს კონკატინაცია
# 4) ჩამოთვალეთ დღეს ნასწავლი მონაცემტა ტიპები
# 5) ორი ცვლადი შექმენით: name(სახელი) და age(ასასკი). ცვლად name-ში ჩაწერე ნებისმიერი სახელი, ხოლო age-ში — რიცხვი. შემდეგ print ით გამოიტანე: "მე მქვია name და მე ვარ age წლის" 
print("red")
print("egg")
print("coding")

print("-----------")

move1="prison break"
move2="braking bad"
print(move1,move2)
print("-----------")

#კონკატინაცია აერთბს

print("-----------")

name="gio"
age=17
print ("my name is", name, "and i am", age, "years old")